Revit 2024 API
ParameterTypeId.IfcSiteGuid Property
 "IfcSite GUID"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId IfcSiteGuid { get; }
Visual Basic
Public Shared ReadOnly Property IfcSiteGuid As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ IfcSiteGuid {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace